app/views/genre_display/new.html.erb

SELECT DISTINCT `genres`.`id` FROM `genres`
SELECT `genres`.* FROM `genres` WHERE `genres`.`genre_id` = 1
SELECT `sub_genres`.`subgenrename` FROM `sub_genres` WHERE `sub_genres`.`genre_id` = 1
---
<h1> Select A Genre and Sub-Genre </h1>
<% Genre.distinct(:genrename).pluck(:id).each do |category| %>
    <% x = Genre.where(id: category) %>
    <h3> <%= x[0].genrename %> </h3>
    <% a = SubGenre.where(genre_id: category).select(:subgenrename).map(&:subgenrename).uniq %>