app/controllers/genres_controller.rb

SELECT `genres`.* FROM `genres`
---
  def index
    @genres = Genre.all

INSERT INTO `genres` (`genrename`, `created_at`, `updated_at`) VALUES ('Sports', '2017-09-17 06:40:29', '2017-09-17 06:40:29')
---
  def create
    @genre = Genre.new(genre_params)

    respond_to do |format|
      if @genre.save

SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
---
    def set_genre
      @genre = Genre.find(params[:id])