app/controllers/genre_display_controller.rb

SELECT `genres`.* FROM `genres` WHERE `genres`.`genrename` = 'Sports'
SELECT `sub_genres`.* FROM `sub_genres` WHERE `sub_genres`.`Genre_id` = 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`sub_genre_id` = 1
---
  def show
      @test = Question.new()

  	  a = Genre.where(genrename:params[:genre])
  	  b = SubGenre.where(Genre_id:a[0].id)
  	  $c = Question.where(sub_genre_id:b[0].id)