app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO `questions` (`ques`, `optA`, `optB`, `optC`, `optD`, `answer`, `sub_genre_id`, `created_at`, `updated_at`) VALUES ('What is the Night Watch?', 'An organisation of disgraced men', 'A group of corpses who kill mindlessly', 'A group of direwolves', 'An organization of high-ranking soldiers', 'Opta', 3, '2017-09-19 13:05:28', '2017-09-19 13:05:28')

  def destroy
    @question.destroy
---
DELETE FROM `questions` WHERE `questions`.`id` = 1

    def set_question
      @question = Question.find(params[:id])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1