app/controllers/sub_genres_controller.rb

  def index
    @sub_genres = SubGenre.all
---
SELECT `sub_genres`.* FROM `sub_genres`

  def create
    @sub_genre = SubGenre.new(sub_genre_params)

    respond_to do |format|
      if @sub_genre.save
---
INSERT INTO `sub_genres` (`subgenrename`, `genre_id`, `created_at`, `updated_at`) VALUES ('Cricket', 1, '2017-09-17 06:44:14', '2017-09-17 06:44:14')

    def set_sub_genre
      @sub_genre = SubGenre.find(params[:id])
---
SELECT  `sub_genres`.* FROM `sub_genres` WHERE `sub_genres`.`id` = 2 LIMIT 1